learndocker/LearnDocker.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<meta name="author" content="Riaan Kleinhans"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/css/reveal.css"/>

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/css/theme/sky.css" id="theme"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/lib/css/zenburn.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h2 class="author">Riaan Kleinhans</h2><p class="date">Created: 2020-12-22 Tue 03:21</p>
</section>
</section>
</section>
<section>
<section id="slide-org7a4bc3f">
<h3 id="org7a4bc3f">This is quick overview of what docker is</h3>
<div class="outline-text-3" id="text-org7a4bc3f">
</div>
</section>
<section id="slide-orge499137">
<h4 id="orge499137">Lets go over a few practical things, Org allows literate programming and that means I can run the commands right in my documentation</h4>
<p>
Here is a quick example:
</p>
<div class="org-src-container">

<pre><code class="shell" >pwd
</code></pre>
</div>

</section>
<section id="slide-org6d8bd6c">
<h4 id="org6d8bd6c">The second neat thing we can do is to tangel a block of code into a file</h4>
<div class="org-src-container">

<pre><code class="yaml" >Here is a file we tangled
You can create full bash scripts here
</code></pre>
</div>

</section>
<section id="slide-orgf10e13d">
<h4 id="orgf10e13d">Lets confirm</h4>
<div class="org-src-container">

<pre><code class="shell" >cat example.txt
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgbb4f4ea">
<h2 id="orgbb4f4ea">Lets tie things together</h2>
<p>
We will be creating a very simple container.
We will  push it to my dockerhub registry and then run it.
</p>

</section>
<section id="slide-org584c534">
<h4 id="org584c534">First I am going to create a very simple nodejs app that I can run in a container</h4>
<div class="org-src-container">

<pre><code class="nodejs" >const http = require('http');
const os = require('os');
console.log("Kubia server starting...");
var handler = function(request, response) {
  console.log("Received request from " + request.connection.remoteAddress);
  response.writeHead(200);
  response.end("You've hit " + os.hostname() + "\n");
};
var www = http.createServer(handler);
www.listen(8080);
</code></pre>
</div>

</section>
<section id="slide-org3179cb1">
<h4 id="org3179cb1">Lets package it with a working environment and see what we get</h4>
<div class="org-src-container">

<pre><code class="yaml" >FROM node:7
ADD app.js /app.js
ENTRYPOINT ["node", "app.js"]
</code></pre>
</div>

</section>
<section id="slide-org3961eef">
<h4 id="org3961eef">Lets use the docker build command to create our docker image</h4>
<div class="org-src-container">

<pre><code class="shell" >docker build -t kubia .
</code></pre>
</div>


</section>
<section id="slide-org4d91286">
<h4 id="org4d91286">Lets look if we can see the docker image</h4>
<div class="org-src-container">

<pre><code class="shell" >docker images
</code></pre>
</div>


</section>
<section id="slide-org917fe2c">
<h4 id="org917fe2c">Lets start a container with the kubia image</h4>
<div class="org-src-container">

<pre><code class="shell" >docker run --name kubia-container -p 8080:8080 -d kubia
</code></pre>
</div>


</section>
<section id="slide-org45182d0">
<h4 id="org45182d0">Lets see if we see it run</h4>
<div class="org-src-container">

<pre><code class="shell" >docker ps
</code></pre>
</div>


</section>
<section id="slide-org41912e8">
<h4 id="org41912e8">Now lets see if we can hit our container</h4>
<div class="org-src-container">

<pre><code class="shell" >curl localhost:8080
</code></pre>
</div>


</section>
<section id="slide-orgdd385e5">
<h4 id="orgdd385e5">Lets inspect our container</h4>
<div class="org-src-container">

<pre><code class="shell" >docker inspect kubia-container
</code></pre>
</div>

</section>
<section id="slide-org4448c55">
<h4 id="org4448c55">Lets go exploring inside the running container</h4>
<div class="org-src-container">

<pre><code class="shell" >docker exec -it kubia-container bash
</code></pre>
</div>

</section>
<section id="slide-org111c224">
<h4 id="org111c224">Lets clean up what we did by stopping and removing the container</h4>
<div class="org-src-container">

<pre><code class="shell" >docker stop kubia-container
docker rm kubia-container
</code></pre>
</div>


</section>
<section id="slide-org117df94">
<h4 id="org117df94">Last steps, lets build and push our container to my registry</h4>
<div class="org-src-container">

<pre><code class="shell" >docker tag kubia bernokl/kubia
</code></pre>
</div>


</section>
<section id="slide-orge81e22e">
<h4 id="orge81e22e">Did our images change?</h4>
<div class="org-src-container">

<pre><code class="shell" >docker images
</code></pre>
</div>


</section>
<section id="slide-org8cebb38">
<h4 id="org8cebb38">Push image to our repo so others can use it</h4>
<div class="org-src-container">

<pre><code class="shell" >docker push bernokl/kubia
</code></pre>
</div>


</section>
</section>
<section>
<section id="slide-orgc8a35f1">
<h2 id="orgc8a35f1">Lets see if we can make this into a presentation</h2>
<p>
The theory is that this file gets a footnotes to set up reveal things
Aite, added the footnotes below, lets try to tangle it out the plan is to hit ", e e v b"
</p>
</div>
</div>
<script src="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/lib/js/head.min.js"></script>
<script src="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/js/reveal.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,

overview: true,
margin: 0.10,
minScale: 1.00,
maxScale: 3.50,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'cube', // see README of reveal.js for options
transitionSpeed: '1',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: 'https://reveal-js-multiplex-ccjbegmaii.now.sh' // Location of socket.io server
},

// Optional libraries used to extend reveal.js
dependencies: [
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'https://cdn.socket.io/socket.io-1.3.5.js', async: true },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/multiplex/master.js', async: true }]

});
</script>
</body>
</html>
